# Lab 1
### Learning outcomes
Upon successful completion of this lab, you will have demonstrated the abilities to:
1.	Loading a dataset into a pandas dataframe
2.	Counting how many rows and columns were loaded
3.	Determining which type of data was loaded
4.	Looking at different parts of the data by subsetting rows and columns
5.	Working with Data Series

#### Before you start
Load the diabetes dataset

## Run this cell, look at the output for each command to make sure you understand the purpose of each command
from sklearn.datasets import load_diabetes
import pandas as pd

diabetes=load_diabetes()
print(diabetes.keys())
print(diabetes.DESCR)
print(diabetes.feature_names) # these are the column names
# attach the feature names to the data as column names
df=pd.DataFrame(diabetes.data, columns=diabetes.feature_names)

In [34]:
from sklearn.datasets import load_diabetes
import pandas as pd

diabetes=load_diabetes()
diabetes

{'data': array([[ 0.03807591,  0.05068012,  0.06169621, ..., -0.00259226,
          0.01990749, -0.01764613],
        [-0.00188202, -0.04464164, -0.05147406, ..., -0.03949338,
         -0.06833155, -0.09220405],
        [ 0.08529891,  0.05068012,  0.04445121, ..., -0.00259226,
          0.00286131, -0.02593034],
        ...,
        [ 0.04170844,  0.05068012, -0.01590626, ..., -0.01107952,
         -0.04688253,  0.01549073],
        [-0.04547248, -0.04464164,  0.03906215, ...,  0.02655962,
          0.04452873, -0.02593034],
        [-0.04547248, -0.04464164, -0.0730303 , ..., -0.03949338,
         -0.00422151,  0.00306441]], shape=(442, 10)),
 'target': array([151.,  75., 141., 206., 135.,  97., 138.,  63., 110., 310., 101.,
         69., 179., 185., 118., 171., 166., 144.,  97., 168.,  68.,  49.,
         68., 245., 184., 202., 137.,  85., 131., 283., 129.,  59., 341.,
         87.,  65., 102., 265., 276., 252.,  90., 100.,  55.,  61.,  92.,
        259.,  53., 190., 142.,  75., 142., 155., 225.,  59., 104., 182.,
        128.,  52.,  37., 170., 170.,  61., 144.,  52., 128.,  71., 163.,
        150.,  97., 160., 178.,  48., 270., 202., 111.,  85.,  42., 170.,
        200., 252., 113., 143.,  51.,  52., 210.,  65., 141.,  55., 134.,
         42., 111.,  98., 164.,  48.,  96.,  90., 162., 150., 279.,  92.,
         83., 128., 102., 302., 198.,  95.,  53., 134., 144., 232.,  81.,
        104.,  59., 246., 297., 258., 229., 275., 281., 179., 200., 200.,
        173., 180.,  84., 121., 161.,  99., 109., 115., 268., 274., 158.,
        107.,  83., 103., 272.,  85., 280., 336., 281., 118., 317., 235.,
         60., 174., 259., 178., 128.,  96., 126., 288.,  88., 292.,  71.,
        197., 186.,  25.,  84.,  96., 195.,  53., 217., 172., 131., 214.,
         59.,  70., 220., 268., 152.,  47.,  74., 295., 101., 151., 127.,
        237., 225.,  81., 151., 107.,  64., 138., 185., 265., 101., 137.,
        143., 141.,  79., 292., 178.,  91., 116.,  86., 122.,  72., 129.,
        142.,  90., 158.,  39., 196., 222., 277.,  99., 196., 202., 155.,
         77., 191.,  70.,  73.,  49.,  65., 263., 248., 296., 214., 185.,
         78.,  93., 252., 150.,  77., 208.,  77., 108., 160.,  53., 220.,
        154., 259.,  90., 246., 124.,  67.,  72., 257., 262., 275., 177.,
         71.,  47., 187., 125.,  78.,  51., 258., 215., 303., 243.,  91.,
        150., 310., 153., 346.,  63.,  89.,  50.,  39., 103., 308., 116.,
        145.,  74.,  45., 115., 264.,  87., 202., 127., 182., 241.,  66.,
         94., 283.,  64., 102., 200., 265.,  94., 230., 181., 156., 233.,
         60., 219.,  80.,  68., 332., 248.,  84., 200.,  55.,  85.,  89.,
         31., 129.,  83., 275.,  65., 198., 236., 253., 124.,  44., 172.,
        114., 142., 109., 180., 144., 163., 147.,  97., 220., 190., 109.,
        191., 122., 230., 242., 248., 249., 192., 131., 237.,  78., 135.,
        244., 199., 270., 164.,  72.,  96., 306.,  91., 214.,  95., 216.,
        263., 178., 113., 200., 139., 139.,  88., 148.,  88., 243.,  71.,
         77., 109., 272.,  60.,  54., 221.,  90., 311., 281., 182., 321.,
         58., 262., 206., 233., 242., 123., 167.,  63., 197.,  71., 168.,
        140., 217., 121., 235., 245.,  40.,  52., 104., 132.,  88.,  69.,
        219.,  72., 201., 110.,  51., 277.,  63., 118.,  69., 273., 258.,
         43., 198., 242., 232., 175.,  93., 168., 275., 293., 281.,  72.,
        140., 189., 181., 209., 136., 261., 113., 131., 174., 257.,  55.,
         84.,  42., 146., 212., 233.,  91., 111., 152., 120.,  67., 310.,
         94., 183.,  66., 173.,  72.,  49.,  64.,  48., 178., 104., 132.,
        220.,  57.]),
 'frame': None,
 'DESCR': '.. _diabetes_dataset:\n\nDiabetes dataset\n----------------\n\nTen baseline variables, age, sex, body mass index, average blood\npressure, and six blood serum measurements were obtained for each of n =\n442 diabetes patients, as well as the response of interest, a\nquantitative measure of disease progression one year after baseline.\n\n**Data Set Characteristics:**\n\n:Number of Instances: 442\n\n:Number of Attributes: First 10 columns are numeric predictive values\n\n:Target: Column 11 is a quantitative measure of disease progression one year after baseline\n\n:Attribute Information:\n    - age     age in years\n    - sex\n    - bmi     body mass index\n    - bp      average blood pressure\n    - s1      tc, total serum cholesterol\n    - s2      ldl, low-density lipoproteins\n    - s3      hdl, high-density lipoproteins\n    - s4      tch, total cholesterol / HDL\n    - s5      ltg, possibly log of serum triglycerides level\n    - s6      glu, blood sugar level\n\nNote: Each of these 10 feature variables have been mean centered and scaled by the standard deviation times the square root of `n_samples` (i.e. the sum of squares of each column totals 1).\n\nSource URL:\nhttps://www4.stat.ncsu.edu/~boos/var.select/diabetes.html\n\nFor more information see:\nBradley Efron, Trevor Hastie, Iain Johnstone and Robert Tibshirani (2004) "Least Angle Regression," Annals of Statistics (with discussion), 407-499.\n(https://web.stanford.edu/~hastie/Papers/LARS/LeastAngle_2002.pdf)\n',
 'feature_names': ['age',
  'sex',
  'bmi',
  'bp',
  's1',
  's2',
  's3',
  's4',
  's5',
  's6'],
 'data_filename': 'diabetes_data_raw.csv.gz',
 'target_filename': 'diabetes_target.csv.gz',
 'data_module': 'sklearn.datasets.data'}

In [35]:
print(diabetes.keys())

dict_keys(['data', 'target', 'frame', 'DESCR', 'feature_names', 'data_filename', 'target_filename', 'data_module'])

In [36]:
print(diabetes.DESCR)

.. _diabetes_dataset:

Diabetes dataset
----------------

Ten baseline variables, age, sex, body mass index, average blood
pressure, and six blood serum measurements were obtained for each of n =
442 diabetes patients, as well as the response of interest, a
quantitative measure of disease progression one year after baseline.

**Data Set Characteristics:**

:Number of Instances: 442

:Number of Attributes: First 10 columns are numeric predictive values

:Target: Column 11 is a quantitative measure of disease progression one year after baseline

:Attribute Information:
    - age     age in years
    - sex
    - bmi     body mass index
    - bp      average blood pressure
    - s1      tc, total serum cholesterol
    - s2      ldl, low-density lipoproteins
    - s3      hdl, high-density lipoproteins
    - s4      tch, total cholesterol / HDL
    - s5      ltg, possibly log of serum triglycerides level
    - s6      glu, blood sugar level

Note: Each of these 10 feature variables have been mean centered and scaled by the standard deviation times the square root of `n_samples` (i.e. the sum of squares of each column totals 1).

Source URL:
https://www4.stat.ncsu.edu/~boos/var.select/diabetes.html

For more information see:
Bradley Efron, Trevor Hastie, Iain Johnstone and Robert Tibshirani (2004) "Least Angle Regression," Annals of Statistics (with discussion), 407-499.
(https://web.stanford.edu/~hastie/Papers/LARS/LeastAngle_2002.pdf)

In [37]:
print(diabetes.feature_names) # these are the column names

['age', 'sex', 'bmi', 'bp', 's1', 's2', 's3', 's4', 's5', 's6']

In [38]:
df=pd.DataFrame(diabetes.data, columns=diabetes.feature_names)
df

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022688,-0.009362
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641
...,...,...,...,...,...,...,...,...,...,...
437,0.041708,0.050680,0.019662,0.059744,-0.005697,-0.002566,-0.028674,-0.002592,0.031193,0.007207
438,-0.005515,0.050680,-0.015906,-0.067642,0.049341,0.079165,-0.028674,0.034309,-0.018114,0.044485
439,0.041708,0.050680,-0.015906,0.017293,-0.037344,-0.013840,-0.024993,-0.011080,-0.046883,0.015491
440,-0.045472,-0.044642,0.039062,0.001215,0.016318,0.015283,-0.028674,0.026560,0.044529,-0.025930
441,-0.045472,-0.044642,-0.073030,-0.081413,0.083740,0.027809,0.173816,-0.039493,-0.004222,0.003064

1. print the number of rows and columns in the dataset using the shape attribute of the dataframe object

In [39]:
df.shape

(442, 10)

2. print the first 5 observations of the dataset.

In [40]:
df.head()

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022688,-0.009362
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641

3. print the column names of the dataset

In [41]:
df.columns

Index(['age', 'sex', 'bmi', 'bp', 's1', 's2', 's3', 's4', 's5', 's6'], dtype='object')

4. get the dtype of each column

In [42]:
df.dtypes

age    float64
sex    float64
bmi    float64
bp     float64
s1     float64
s2     float64
s3     float64
s4     float64
s5     float64
s6     float64
dtype: object

5. use loc to show the second row of the dataset.

In [43]:
df.loc[1]

age   -0.001882
sex   -0.044642
bmi   -0.051474
bp    -0.026328
s1    -0.008449
s2    -0.019163
s3     0.074412
s4    -0.039493
s5    -0.068332
s6    -0.092204
Name: 1, dtype: float64

6. use loc to show the second, 100th and 150th rows of the dataset

In [44]:
df.loc[[1,99,149]]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
99,-0.001882,-0.044642,-0.064408,0.011544,0.027326,0.037517,-0.013948,0.034309,0.011785,-0.054925
149,-0.049105,0.050680,-0.005128,-0.046985,-0.020832,-0.020416,-0.069172,0.071210,0.061238,-0.038357

7. use iloc to show the the second and 100th rows of the dataset

In [45]:
df.iloc[[1,99]]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
99,-0.001882,-0.044642,-0.064408,0.011544,0.027326,0.037517,-0.013948,0.034309,0.011785,-0.054925

8. use loc to show the bmi column of the dataset

In [46]:
df.loc[:, 'bmi']

0      0.061696
1     -0.051474
2      0.044451
3     -0.011595
4     -0.036385
         ...
437    0.019662
438   -0.015906
439   -0.015906
440    0.039062
441   -0.073030
Name: bmi, Length: 442, dtype: float64

9. Use loc to show the bmi, bp columns of the dataset

In [47]:
df.loc[:, ['bmi','bp']]

          bmi        bp
0    0.061696  0.021872
1   -0.051474 -0.026328
2    0.044451 -0.005670
3   -0.011595 -0.036656
4   -0.036385  0.021872
..        ...       ...
437  0.019662  0.059744
438 -0.015906 -0.067642
439 -0.015906  0.017293
440  0.039062  0.001215
441 -0.073030 -0.081413

[442 rows x 2 columns]

10. use iloc to show the last row of the dataset

In [48]:
df.iloc[-1]

age   -0.045472
sex   -0.044642
bmi   -0.073030
bp    -0.081413
s1     0.083740
s2     0.027809
s3     0.173816
s4    -0.039493
s5    -0.004222
s6     0.003064
Name: 441, dtype: float64

11. Use iloc to show the last two observations of the dataset

In [49]:
df.iloc[-2:,:]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
440,-0.045472,-0.044642,0.039062,0.001215,0.016318,0.015283,-0.028674,0.026560,0.044529,-0.025930
441,-0.045472,-0.044642,-0.073030,-0.081413,0.083740,0.027809,0.173816,-0.039493,-0.004222,0.003064

12. use loc to create a subset of the first 10 obs for age,bmi,bp columns. Then show the first 5 obs of the subset dataframe.

In [50]:
subDf_q12 = df.loc[:10,["age","bmi","bp"]]
subDf_q12.head()

        age       bmi        bp
0  0.038076  0.061696  0.021872
1 -0.001882 -0.051474 -0.026328
2  0.085299  0.044451 -0.005670
3 -0.089063 -0.011595 -0.036656
4  0.005383 -0.036385  0.021872

13. Use iloc and slicing columns method with colon (:) to slice the first 6 columns of the dataset)keep all rows). Save the sliced subset in dataframe subset, then show the first 5 obs of dataframe subset.

In [51]:
subDf_q13 = df.iloc[:,:6]
subDf_q13.head()

        age       sex       bmi        bp        s1        s2
0  0.038076  0.050680  0.061696  0.021872 -0.044223 -0.034821
1 -0.001882 -0.044642 -0.051474 -0.026328 -0.008449 -0.019163
2  0.085299  0.050680  0.044451 -0.005670 -0.045599 -0.034194
3 -0.089063 -0.044642 -0.011595 -0.036656  0.012191  0.024991
4  0.005383 -0.044642 -0.036385  0.021872  0.003935  0.015596

14. slice columns 3 to 5 inclusive into dataframe subset. then show the first 5 obs of dataframe subset.

In [52]:
subDf_q14 = df.iloc[:,2:5]
subDf_q14.head()

        bmi        bp        s1
0  0.061696  0.021872 -0.044223
1 -0.051474 -0.026328 -0.008449
2  0.044451 -0.005670 -0.045599
3 -0.011595 -0.036656  0.012191
4 -0.036385  0.021872  0.003935

15. use iloc and slice every other column up to 5 inclusive into a dataframe subset. Then show the first 5 obs of the dataframe subset.

In [53]:
subDf_q15 = df.iloc[:,:5:2] # Every other meaning Skip.
subDf_q15.head()

        age       bmi        s1
0  0.038076  0.061696 -0.044223
1 -0.001882 -0.051474 -0.008449
2  0.085299  0.044451 -0.045599
3 -0.089063 -0.011595  0.012191
4  0.005383 -0.036385  0.003935

16. Use loc to display the age for the 10th row of the dataframe.

In [54]:
print(df.loc[9,"age"])

-0.07090024709715959

17. Use loc to display the bmi for row numbers 100, 200 and 300.

In [55]:
df.loc[[99,199,299],"bmi"]

99    -0.064408
199   -0.045007
299   -0.013751
Name: bmi, dtype: float64

For the rest of the questions, please run the below cell first, and use new_df to answer these questions.

In [56]:
# URL of the data
url = "https://www4.stat.ncsu.edu/~boos/var.select/diabetes.tab.txt"

# Import the data into a DataFrame
new_df = pd.read_csv(url, sep='\t')

In [57]:
new_df.rename(columns={'AGE': 'age', 'SEX': 'sex', 'BMI': 'bmi', 'BP': 'bp', 'S1': 's1', 'S2': 's2', 'S3': 's3', 'S4': 's4', 'S5': 's5', 'S6': 's6'}, inplace=True)
new_df

     age  sex   bmi      bp   s1     s2    s3    s4      s5   s6    Y
0     59    2  32.1  101.00  157   93.2  38.0  4.00  4.8598   87  151
1     48    1  21.6   87.00  183  103.2  70.0  3.00  3.8918   69   75
2     72    2  30.5   93.00  156   93.6  41.0  4.00  4.6728   85  141
3     24    1  25.3   84.00  198  131.4  40.0  5.00  4.8903   89  206
4     50    1  23.0  101.00  192  125.4  52.0  4.00  4.2905   80  135
..   ...  ...   ...     ...  ...    ...   ...   ...     ...  ...  ...
437   60    2  28.2  112.00  185  113.8  42.0  4.00  4.9836   93  178
438   47    2  24.9   75.00  225  166.0  42.0  5.00  4.4427  102  104
439   60    2  24.9   99.67  162  106.6  43.0  3.77  4.1271   95  132
440   36    1  30.0   95.00  201  125.2  42.0  4.79  5.1299   85  220
441   36    1  19.6   71.00  250  133.2  97.0  3.00  4.5951   92   57

[442 rows x 11 columns]

18. use loc to display the data where age>50.

In [58]:
new_df.loc[new_df['age'] > 50]

     age  sex   bmi      bp   s1     s2    s3    s4      s5   s6    Y
0     59    2  32.1  101.00  157   93.2  38.0  4.00  4.8598   87  151
2     72    2  30.5   93.00  156   93.6  41.0  4.00  4.6728   85  141
7     66    2  26.2  114.00  255  185.0  56.0  4.55  4.2485   92   63
8     60    2  32.1   83.00  179  119.4  42.0  4.00  4.4773   94  110
11    56    2  28.0   85.00  184  144.8  32.0  6.00  3.5835   77   69
..   ...  ...   ...     ...  ...    ...   ...   ...     ...  ...  ...
431   68    2  23.5  101.00  162   85.4  59.0  3.00  4.4773   91   66
432   51    1  31.5   93.00  231  144.0  49.0  4.70  5.2523  117  173
434   53    1  26.5   97.00  193  122.4  58.0  3.00  4.1431   99   49
437   60    2  28.2  112.00  185  113.8  42.0  4.00  4.9836   93  178
439   60    2  24.9   99.67  162  106.6  43.0  3.77  4.1271   95  132

[215 rows x 11 columns]

19. use loc to display only bmi and bp for the females only.

In [59]:
new_df.loc[new_df['sex'] == 2, ['bmi', 'bp']] # Assuming Number 2 is the Standard for the Female in column 'sex'

      bmi      bp
0    32.1  101.00
2    30.5   93.00
6    22.0   90.00
7    26.2  114.00
8    32.1   83.00
..    ...     ...
428  34.6  120.00
431  23.5  101.00
437  28.2  112.00
438  24.9   75.00
439  24.9   99.67

[207 rows x 2 columns]

20. Get a series of age column from the dataframe object.

In [60]:
ageSeries = new_df['age']
ageSeries

0      59
1      48
2      72
3      24
4      50
       ..
437    60
438    47
439    60
440    36
441    36
Name: age, Length: 442, dtype: int64

21. print the min, max and mean values for the age series.

In [61]:
print("Min =",ageSeries.min())
print("Max =",ageSeries.max())
print("Mean =",ageSeries.mean())

Min = 19
Max = 79
Mean = 48.51809954751131

22.print the basic information about age series

In [62]:
ageSeries.info() # ageSeries.describe()

<class 'pandas.core.series.Series'>
RangeIndex: 442 entries, 0 to 441
Series name: age
Non-Null Count  Dtype
--------------  -----
442 non-null    int64
dtypes: int64(1)
memory usage: 3.6 KB

23.print the subset of ages that are less than mean age value

In [63]:
subDf_q23 = new_df.loc[ageSeries<ageSeries.mean(),"age"] 
# new_df.loc[ageSeries<ageSeries.mean()]['age']
# new_df[ageSeries<ageSeries.mean()]['age']
subDf_q23

1      48
3      24
5      23
6      36
9      29
       ..
435    45
436    33
438    47
440    36
441    36
Name: age, Length: 202, dtype: int64

24.Sort the age series and print sorted values.

In [68]:
ageSeries.sort_values() # sorted(ageSeries)

26     19
374    19
344    19
242    20
226    20
       ..
211    74
311    75
321    75
204    79
402    79
Name: age, Length: 442, dtype: int64

25.print all the unique values from the age series.

In [71]:
ageSeries.unique()

array([59, 48, 72, 24, 50, 23, 36, 66, 60, 29, 22, 56, 53, 61, 34, 47, 68,
       38, 41, 35, 25, 31, 30, 19, 42, 63, 67, 32, 58, 57, 62, 52, 46, 21,
       54, 33, 27, 37, 65, 39, 40, 20, 44, 49, 43, 64, 55, 51, 28, 45, 26,
       71, 79, 74, 69, 70, 75, 73])